In [198]:
import pandas as pd
import numpy as np

In [2]:
xxx = pd.read_excel(r"xxx one-liner 2018-19.xlsx")

In [197]:
yyy= pd.read_excel(r"yyy One liner 2018-19.xlsx")

In [4]:
zzz= pd.read_excel(r"zzz onliner.xlsx")

In [5]:
yyy.head()

,SL_NO,PCD_CODE,PCD_COD1E,EMP_NAME,EMP_NAME1,DOB,AGE,DOJ,DOL,DOS,TOTAL MC,TOTAL CC,TOTAL VC1,GRAND TOTAL
0,1,50003,50003,NEELESH SHANBHAG,NEELESH SHANBHAG,1973-08-22,45.604381,2002-10-13,2014-07-25,NaT,0,0.0,0.0,0.0
1,2,50008,50008,C PERUMAL,C PERUMAL,1954-06-12,64.799452,2003-03-17,2014-06-30,NaT,0,0.0,0.0,0.0
2,3,50009,50009,NARAYAN BL,NARAYAN BL,1958-07-18,60.700890,2003-03-17,2014-06-30,NaT,0,0.0,0.0,0.0
3,4,50012,50012,GAYATRI FABIAN,GAYATRI FABIAN,1967-03-18,52.035592,2003-03-17,2014-08-04,NaT,0,0.0,0.0,0.0
4,5,50019,50019,AJAY TYAGI,AJAY TYAGI,1975-05-20,43.863107,2003-04-01,2015-06-26,NaT,0,0.0,0.0,0.0

In [6]:
zzz.head()

,SL_NO,PCD_CODE,PCD_CODE1,EMP_NAME,DOB,DOJ,2019-03-31 00:00:00,PF_ST_DATE,PF_NO,REG_EXP_CODE,...,DOS,Unnamed: 18,Unnamed: 19,TOT_MC,TOT_IMC,TOT_CC,TOT_ICC,TOT_VC1,TOT_IVC1,Grand Total
0,1.0,10047_FS,10047_FS,DEBASISH MAZUMDER,1966-02-13,2002-06-13,53.125257,2002-06-13,'000066,'PU/PUN/0031643/00E,...,NaN,NaN,NaN,0.0,0.0,0,0.0,0.0,0.0,0.0
1,2.0,10054_FS,10054_FS,KRIPASHANKAR RAJAPPA,1966-05-10,1995-07-01,52.889802,2008-07-01,'950,'PU/PUN/0031643/00E,...,NaN,NaN,NaN,4444105.0,384420.0,4324321,374052.0,0.0,0.0,9526898.0
2,3.0,10099_FS,10099_FS,F G LOBO,1958-05-02,1995-11-01,60.911704,1995-11-01,'000092,'PU/PUN/0031643/00E,...,NaN,NaN,NaN,0.0,0.0,0,0.0,0.0,0.0,0.0
3,4.0,10106_FS,10106_FS,LAKHBINDER SINGH,1969-06-02,1995-12-21,49.826146,2008-07-01,'53,'PU/PUN/0031643/00E,...,NaN,NaN,NaN,1601619.0,135900.0,1207409,102504.0,0.0,0.0,3047432.0
4,5.0,10118_FS,10118_FS,GAUTAM A KANTAK,1970-06-05,2001-02-11,48.818617,2001-02-11,'000094,'PU/PUN/0031643/00E,...,NaN,NaN,NaN,0.0,0.0,0,0.0,0.0,0.0,0.0

In [7]:
xxx.head()

,SL_NO,PCD_CODE,PCD_CODE1,EMP_NAME,EMP_NAME1,DOB,AGE,DOJ,DOL,DOS,TOTAL MC,TOTAL CC,TOTAL VC1,GRAND TOTAL
0,1,1,1,ABC UNIDEFINED,ABC UNIDEFINED,2000-01-01,19.244353,2009-03-31,2009-03-31,NaT,0.0,0.0,0.0,0.0
1,2,100,100,D V NARAYAN PRASAD,D V NARAYAN PRASAD,1969-01-22,50.184805,1998-08-19,NaT,NaT,5331336.0,5150735.0,0.0,10482071.0
2,3,10000,10000,HARI VARMA,HARI VARMA,1981-07-06,37.733060,2007-03-28,2009-06-05,NaT,0.0,0.0,0.0,0.0
3,4,10002,10002,SUBRAMANIAN VENKATRAMAN,SUBRAMANIAN VENKATRAMAN,1979-12-14,39.293634,2007-03-27,2010-10-12,NaT,0.0,0.0,0.0,0.0
4,5,10003,10003,AMOL PANDE,AMOL PANDE,1983-01-10,36.219028,2007-03-30,2007-06-28,NaT,7686.0,4957.0,0.0,12643.0

In [8]:
xxx['PCD_CODE'].unique().size

155417

In [9]:
xxx.shape

(155427, 14)

## 1 value is redundant rest are spaces

In [10]:
xxx['PCD_CODE'].value_counts(ascending= True)

172422    1
73784     1
85992     1
140834    1
45974     1
         ..
151082    1
190804    1
182813    1
28058     1
161000    2
Name: PCD_CODE, Length: 155416, dtype: int64

In [11]:
xxx[xxx['PCD_CODE'] == "161000"]

,SL_NO,PCD_CODE,PCD_CODE1,EMP_NAME,EMP_NAME1,DOB,AGE,DOJ,DOL,DOS,TOTAL MC,TOTAL CC,TOTAL VC1,GRAND TOTAL
139340,139341,161000,161000,SAI RAM CHARAN POLAMARASETTI,Sai Ram Charan Polamarasetti,1997-01-21,22.187543,2018-09-19,NaT,NaT,0.0,0.0,0.0,0.0
144640,144641,161000,161000,SAI RAM CHARAN POLAMARASETTI,SAI RAM CHARAN POLAMARASETTI,1997-01-21,22.187543,2018-09-19,2019-02-11,2019-06-30,3785.0,3785.0,0.0,7570.0

### The above two data were redundant in xxx Frontlier 2018-2019

In [12]:
yyy["PCD_CODE"].unique().size

33829

In [13]:
yyy.shape

(33836, 14)

### 7 extra rows, where all are spaces in yyy Frontlier

In [14]:
yyy["PCD_CODE"].value_counts().unique()

array([1], dtype=int64)

Therefore no redundant value.

In [15]:
zzz["PCD_CODE"].value_counts()

26403_FS     1
29289_FS     1
86976_FS     1
55428_FS     1
35115_FS     1
            ..
103093_FS    1
55180_FS     1
72204_FS     1
33612_FS     1
70227_FS     1
Name: PCD_CODE, Length: 70214, dtype: int64

In [16]:
fs.shape

(70220, 27)

In [17]:
fs["PCD_CODE"].value_counts().unique()

array([1], dtype=int64)

### Therefore no redundant data in zzz Frontlier

In [18]:
pcd=pd.DataFrame()

In [19]:
pcd.insert(0,"xxx",xxx["PCD_CODE"])

In [20]:
pcd.shape

(155427, 1)

In [21]:
pcd.insert(1,"yyy",yyy["PCD_CODE"])

In [22]:
pcd.insert(2,"zzz",zzz["PCD_CODE"])

In [ ]:
pcd.head()

In [24]:
pcd.shape

(155427, 3)

In [ ]:
pcd.describe()

In [26]:
pcd['fs'].value_counts()

26403_FS     1
112606_FS    1
104471_FS    1
25299_FS     1
100210_FS    1
            ..
75987_FS     1
34757_FS     1
58485_FS     1
68481_FS     1
70227_FS     1
Name: fs, Length: 70214, dtype: int64

In [164]:
tot= pd.DataFrame(pd.merge(xxx,yyy,on=["PCD_CODE"],how="inner",suffixes=('_ACIS','_BSV')))

In [165]:
tot.head(15)

,SL_NO_ACIS,PCD_CODE,PCD_CODE1,EMP_NAME_ACIS,EMP_NAME1_ACIS,DOB_ACIS,AGE_ACIS,DOJ_ACIS,DOL_ACIS,DOS_ACIS,...,EMP_NAME1_BSV,DOB_BSV,AGE_BSV,DOJ_BSV,DOL_BSV,DOS_BSV,TOTAL MC_BSV,TOTAL CC_BSV,TOTAL VC1_BSV,GRAND TOTAL_BSV
0,226,10230,10230,ALOK GUPTA,ALOK GUPTA,1977-10-01,41.494867,2007-04-09,2007-04-23,NaT,...,SRINIVASAN,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,49674,39947.0,62079.0,151700.0
1,977,110,110,SUNIL NAIR,SUNIL NAIR,1968-10-03,50.488706,1999-10-04,NaT,NaT,...,NATAARAJ V S,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,17999,6033.0,0.0,24032.0
2,1963,12,12,JAGDISH MISRA,JAGDISH MISRA,1971-05-27,47.843943,1997-10-01,2018-01-31,2018-07-31,...,KALYANI S,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,23941,8013.0,0.0,31954.0
3,2977,130,130,VIKRAM SINHA,VIKRAM SINHA,1975-01-01,44.243669,2000-06-05,2001-03-31,NaT,...,DEEPA PANJWANI,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,39426,17909.0,0.0,57335.0
4,3280,133,133,ANIL GUPTA,ANIL GUPTA,1964-07-09,54.724162,2000-07-17,2010-08-06,NaT,...,NAGARAJU R,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,2830,949.0,0.0,3779.0
5,4662,1465,1465,DEVI PRASAD MOHANTY,DEVI PRASAD MOHANTY,1977-01-03,42.236824,2003-12-22,2012-08-28,NaT,...,SUJATHA R,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,514,172.0,0.0,686.0
6,4809,1481,1481,CHENNA GOVINDU,CHENNA GOVINDU,1980-07-18,38.699521,2003-12-29,2008-07-18,NaT,...,NAGARATHNAM MAYA,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,1314,567.0,0.0,1881.0
7,4811,1483,1483,LUETTE BRAGANZA,LUETTE BRAGANZA,1972-09-13,46.543463,2003-12-29,2009-08-14,NaT,...,KRISHNA MOORTHY,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,991,327.0,0.0,1318.0
8,4812,1484,1484,GANESH KALE,GANESH KALE,1976-01-22,43.186858,2003-12-29,NaT,NaT,...,SRIKANTH K,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,885,303.0,0.0,1188.0
9,7796,183,183,GOVIND SHARMA,GOVIND SHARMA,1979-04-20,39.945243,2001-01-01,2010-01-22,NaT,...,BAHIR V M,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,3286,1099.0,0.0,4385.0
10,8083,186,186,SHRIKANT BHAT,SHRIKANT BHAT,1968-05-05,50.902122,2001-01-01,2010-12-31,NaT,...,VIDYA NAIK,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,12347,4127.0,0.0,16474.0
11,8176,187,187,VINAY SHETTY,VINAY SHETTY,1969-04-03,49.990418,2001-01-01,2010-12-14,NaT,...,RAMESH TIPPINNI,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,19108,6397.0,0.0,25505.0
12,8981,195,195,NAVIN CHANDIRAMANI,NAVIN CHANDIRAMANI,1974-02-21,45.103354,2013-02-05,2013-02-05,NaT,...,YASEER ARAFAT R,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,16681,5590.0,0.0,22271.0
13,9777,206,206,LOVEKESH BABBAR,LOVEKESH BABBAR,1972-04-28,46.921287,2001-02-12,2005-10-25,NaT,...,KIRAN BABU S,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,16333,5468.0,0.0,21801.0
14,10517,214,214,VIJAY GANGAL,VIJAY GANGAL,1960-12-27,58.255989,2001-03-01,NaT,NaT,...,SHEIK TAUSID SAJJAD,1960-04-01,58.995209,2000-04-01,2001-03-31,NaT,19634,7684.0,0.0,27318.0

In [150]:
tot=tot.drop(["PCD_COD1E"],axis=1)

In [148]:
tot.shape

(15722, 26)

In [151]:
tot.to_csv(r"xxxx_yyy.csv")

In [30]:
tot[tot["EMP_NAME_x"]==tot["EMP_NAME_y"]]

Empty DataFrame
Columns: [SL_NO_x, PCD_CODE, PCD_CODE1, EMP_NAME_x, EMP_NAME1_x, DOB_x, AGE_x, DOJ_x, DOL_x, DOS_x, TOTAL MC_x, TOTAL CC_x, TOTAL VC1_x, GRAND TOTAL_x, SL_NO_y, PCD_COD1E, EMP_NAME_y, EMP_NAME1_y, DOB_y, AGE_y, DOJ_y, DOL_y, DOS_y, TOTAL MC_y, TOTAL CC_y, TOTAL VC1_y, GRAND TOTAL_y]
Index: []

[0 rows x 27 columns]

In [31]:
tot["PCD_CODE"].notna().value_counts()

True     15642
False       80
Name: PCD_CODE, dtype: int64

In [32]:
tot.shape

(15722, 27)

### The above data is common in xxx and yyy

In [33]:
tot1= yyy.merge(zzz,left_on = ["PCD_CODE"], right_on = ["PCD_CODE"])

In [34]:
tot1.head()

,SL_NO_x,PCD_CODE,PCD_COD1E,EMP_NAME_x,EMP_NAME1,DOB_x,AGE,DOJ_x,DOL_x,DOS_x,...,DOS_y,Unnamed: 18,Unnamed: 19,TOT_MC,TOT_IMC,TOT_CC,TOT_ICC,TOT_VC1,TOT_IVC1,Grand Total
0,NaN,NaN,NaN,NaN,NaN,NaT,NaN,NaT,NaT,NaT,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaT,NaN,NaT,NaT,NaT,...,Total As per Oneliner,NaN,NaN,4.741343e+09,356908147.0,3.19599e+09,241215916.0,12578492.0,659426.0,8.548700e+09
2,NaN,NaN,NaN,NaN,NaN,NaT,NaN,NaT,NaT,NaT,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaT,NaN,NaT,NaT,NaT,...,NaN,NaN,NaN,NaN,NaN,Less: Differential Interest for 2018-19 (8.65%...,NaN,NaN,NaN,1.098109e+06
4,NaN,NaN,NaN,NaN,NaN,NaT,NaN,NaT,NaT,NaT,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### No data common in yyy and zzz

In [35]:
tot2= pd.merge(xxx,zzz,on=["PCD_CODE"],how="inner")

In [36]:
tot2.head()

,SL_NO_x,PCD_CODE,PCD_CODE1_x,EMP_NAME_x,EMP_NAME1,DOB_x,AGE,DOJ_x,DOL_x,DOS_x,...,DOS_y,Unnamed: 18,Unnamed: 19,TOT_MC,TOT_IMC,TOT_CC,TOT_ICC,TOT_VC1,TOT_IVC1,Grand Total
0,NaN,NaN,NaN,NaN,NaN,NaT,NaN,NaT,NaT,NaT,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaT,NaN,NaT,NaT,NaT,...,Total As per Oneliner,NaN,NaN,4.741343e+09,356908147.0,3.19599e+09,241215916.0,12578492.0,659426.0,8.548700e+09
2,NaN,NaN,NaN,NaN,NaN,NaT,NaN,NaT,NaT,NaT,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaT,NaN,NaT,NaT,NaT,...,NaN,NaN,NaN,NaN,NaN,Less: Differential Interest for 2018-19 (8.65%...,NaN,NaN,NaN,1.098109e+06
4,NaN,NaN,NaN,NaN,NaN,NaT,NaN,NaT,NaT,NaT,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [37]:
tot2["PCD_CODE"].notna().value_counts()

False    60
Name: PCD_CODE, dtype: int64

### No Data common in xxx and yyy

# Part 2

In [38]:
bsvt = pd.read_excel(r"EMP-MASTER.xlsx",sheet_name = "yyy-Trust master")

In [39]:
bsvt.head()

,SL_NO,COMP_CODE,UNIT_CODE/location code,PCD_CODE,PCD_CODE1,EMP_NAME,SEX,MARITAL_STATUS,DOB,DOJ,DOL,PF_NO,PF_MEM_START_DATE,GR_START_DATE,EPS_NO
0,1,CGBS,'001,52996,52996,SRINIVASAN M,NaN,NaN,1987-06-25,2010-05-01,2010-10-21 00:00:00,529963141,2010-05-01,2010-05-01,3141
1,2,CGBS,'001,52997,52997,MOHAMMAD RAFI N,NaN,NaN,1987-05-10,2010-05-01,2012-07-27 00:00:00,529973028,2010-05-01,2010-05-01,3028
2,3,CGBS,'001,52998,52998,NINGTHEM NONGMAITHEMBA,M,NaN,1984-05-03,2010-05-01,2014-08-01 00:00:00,529983140,2010-05-01,2010-05-01,3140
3,4,CGBS,'001,52999,52999,CELIN M,NaN,NaN,1987-02-28,2010-05-01,2011-07-29 00:00:00,529993190,2010-05-01,2010-05-01,3190
4,5,CGBS,'001,53001,53001,YAMUNA V,NaN,NaN,1986-12-02,2010-05-01,2013-04-18 00:00:00,530013191,2010-05-01,2010-05-01,3191

In [40]:
bsvt.shape

(36810, 15)

In [41]:
bsvt['PCD_CODE'].unique().size

36809

In [42]:
bsvt["PCD_CODE"].value_counts()

050541_BS    2
76959        1
64302        1
205568_BS    1
78999        1
            ..
206311_BS    1
59018        1
66312        1
077511_BS    1
203091_BS    1
Name: PCD_CODE, Length: 36809, dtype: int64

In [43]:
bsvt[bsvt["PCD_CODE"] == "050541_BS"]

,SL_NO,COMP_CODE,UNIT_CODE/location code,PCD_CODE,PCD_CODE1,EMP_NAME,SEX,MARITAL_STATUS,DOB,DOJ,DOL,PF_NO,PF_MEM_START_DATE,GR_START_DATE,EPS_NO
31542,31543,CGBS,'001,050541_BS,050541_BS,Victor Previn Previn,M,U,1980-07-09,2019-10-01,NaN,NaN,2019-10-01,2019-10-01,NaN
35218,35219,CGBS,'001,050541_BS,050541_BS,VICTOR PREVIN KUMAR D,M,NaN,1980-07-09,2000-04-01,NaN,50541,2000-04-01,NaT,50541

## The above data is redundant in yyy-True Master

In [44]:
tot_bsv = pd.merge(bsvt,yyy,on=["PCD_CODE"],how="outer",indicator = True)

In [45]:
tot_bsv.shape

(36834, 29)

In [46]:
tot=pd.DataFrame(tot_yyy["PCD_CODE"])

In [47]:
tot.head()

  PCD_CODE
0    52996
1    52997
2    52998
3    52999
4    53001

In [48]:
yyy.shape

(33836, 14)

In [49]:
tot_bsv.head()

,SL_NO_x,COMP_CODE,UNIT_CODE/location code,PCD_CODE,PCD_CODE1,EMP_NAME_x,SEX,MARITAL_STATUS,DOB_x,DOJ_x,...,DOB_y,AGE,DOJ_y,DOL_y,DOS,TOTAL MC,TOTAL CC,TOTAL VC1,GRAND TOTAL,_merge
0,1.0,CGBS,'001,52996,52996,SRINIVASAN M,NaN,NaN,1987-06-25,2010-05-01,...,1987-06-25,31.764545,2010-05-01,2010-10-21,NaT,0,0.0,0.0,0.0,both
1,2.0,CGBS,'001,52997,52997,MOHAMMAD RAFI N,NaN,NaN,1987-05-10,2010-05-01,...,1987-05-10,31.890486,2010-05-01,2012-07-27,NaT,0,0.0,0.0,0.0,both
2,3.0,CGBS,'001,52998,52998,NINGTHEM NONGMAITHEMBA,M,NaN,1984-05-03,2010-05-01,...,1984-05-03,34.907598,2010-05-01,2014-08-01,2017-09-01,0,0.0,0.0,0.0,both
3,4.0,CGBS,'001,52999,52999,CELIN M,NaN,NaN,1987-02-28,2010-05-01,...,1987-02-28,32.084873,2010-05-01,2011-07-29,NaT,0,0.0,0.0,0.0,both
4,5.0,CGBS,'001,53001,53001,YAMUNA V,NaN,NaN,1986-12-02,2010-05-01,...,1986-12-02,32.325804,2010-05-01,2013-04-18,NaT,0,0.0,0.0,0.0,both

In [50]:
tot_bsv[tot_bsv["PCD_CODE"]== "65536"]

,SL_NO_x,COMP_CODE,UNIT_CODE/location code,PCD_CODE,PCD_CODE1,EMP_NAME_x,SEX,MARITAL_STATUS,DOB_x,DOJ_x,...,DOB_y,AGE,DOJ_y,DOL_y,DOS,TOTAL MC,TOTAL CC,TOTAL VC1,GRAND TOTAL,_merge
24954,24955.0,CGBS,'001,65536,65536,DAREDDY THRIVED,M,NaN,1993-05-24,2015-02-04,...,1993-05-24,25.850787,2015-02-04,2017-05-04,2018-01-12,0,0.0,0.0,0.0,both

In [51]:
ff=pd.concat([yyy,bsvt])

In [52]:
ff.shape

(70646, 23)

In [53]:
33836+36810

70646

In [54]:
ff["PCD_CODE"].unique().size

36826

In [55]:
70646-54184

16462

In [56]:
ff.head()

,SL_NO,PCD_CODE,PCD_COD1E,EMP_NAME,EMP_NAME1,DOB,AGE,DOJ,DOL,DOS,...,GRAND TOTAL,COMP_CODE,UNIT_CODE/location code,PCD_CODE1,SEX,MARITAL_STATUS,PF_NO,PF_MEM_START_DATE,GR_START_DATE,EPS_NO
0,1,50003,50003,NEELESH SHANBHAG,NEELESH SHANBHAG,1973-08-22,45.604381,2002-10-13,2014-07-25 00:00:00,NaT,...,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaT,NaN
1,2,50008,50008,C PERUMAL,C PERUMAL,1954-06-12,64.799452,2003-03-17,2014-06-30 00:00:00,NaT,...,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaT,NaN
2,3,50009,50009,NARAYAN BL,NARAYAN BL,1958-07-18,60.700890,2003-03-17,2014-06-30 00:00:00,NaT,...,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaT,NaN
3,4,50012,50012,GAYATRI FABIAN,GAYATRI FABIAN,1967-03-18,52.035592,2003-03-17,2014-08-04 00:00:00,NaT,...,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaT,NaN
4,5,50019,50019,AJAY TYAGI,AJAY TYAGI,1975-05-20,43.863107,2003-04-01,2015-06-26 00:00:00,NaT,...,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaT,NaN

In [57]:
ff1 = pd.DataFrame(ff['PCD_CODE'].value_counts())

In [58]:
#check
ff['PCD_CODE'].value_counts()

70090        2
61840        2
078845_BS    2
51404        2
078514_BS    2
            ..
46008492     1
005856_BS    1
150031_BS    1
188727_BS    1
46005555     1
Name: PCD_CODE, Length: 36825, dtype: int64

In [59]:
#contains value counts of codes
ff1.head()

           PCD_CODE
70090             2
61840             2
078845_BS         2
51404             2
078514_BS         2

In [60]:
ff1.shape

(36825, 1)

In [61]:
un_values=ff1[ff1["PCD_CODE"]==1]

In [62]:
ff1[ff1["PCD_CODE"]==1].size

3012

In [63]:
un_values.index.unique().shape

(3012,)

In [64]:
un_values.head()

           PCD_CODE
172686_BS         1
46014970          1
163796_BS         1
152465_BS         1
46012602          1

In [65]:
un_values.shape

(3012, 1)

In [66]:
#PCD_Code on unique values in combined dataset
un=pd.DataFrame(un_values.index)

In [67]:
un.head()

           0
0  172686_BS
1   46014970
2  163796_BS
3  152465_BS
4   46012602

In [68]:
un.shape

(3012, 1)

In [69]:
un.columns=['PCD_CODE']

In [70]:
un.head()

    PCD_CODE
0  172686_BS
1   46014970
2  163796_BS
3  152465_BS
4   46012602

In [71]:
un['PCD_CODE'].unique().shape

(3012,)

In [72]:
un[un["PCD_CODE"]==50003]

Empty DataFrame
Columns: [PCD_CODE]
Index: []

In [73]:
yyy[yyy["PCD_CODE"]==50003]

Empty DataFrame
Columns: [SL_NO, PCD_CODE, PCD_COD1E, EMP_NAME, EMP_NAME1, DOB, AGE, DOJ, DOL, DOS, TOTAL MC, TOTAL CC, TOTAL VC1, GRAND TOTAL]
Index: []

In [74]:
diff_bsv = pd.DataFrame(pd.merge(bsv,un,how = "inner",indicator = True))

In [75]:
diff_bsv.shape

(16, 15)

In [76]:
diff_bsv.head(16)

,SL_NO,PCD_CODE,PCD_COD1E,EMP_NAME,EMP_NAME1,DOB,AGE,DOJ,DOL,DOS,TOTAL MC,TOTAL CC,TOTAL VC1,GRAND TOTAL,_merge
0,7999,50023,50023,S.SRIRAM,S.SRIRAM,1979-05-12,39.885010,2003-04-01,NaT,NaT,270357,190595.0,0.0,460952.0,both
1,8734,55786,55786,VIJAY J,VIJAY J,1983-01-03,36.238193,2011-07-18,NaT,NaT,102259,32351.0,0.0,134610.0,both
2,10775,62326,62326,MS. LATHA BN,MS. LATHA BN,1986-06-05,32.818617,2014-04-14,NaT,NaT,113658,38410.0,0.0,152068.0,both
3,12800,66144,66144,TULASI PM,TULASI PM,1986-02-03,33.152635,2015-03-23,NaT,NaT,84356,27969.0,0.0,112325.0,both
4,13266,66913,66913,MANOJ RAGHUNATH B,MANOJ RAGHUNATH B,1988-03-02,31.077344,2015-06-08,NaT,NaT,104669,38867.0,0.0,143536.0,both
5,14102,68227,68227,SURENDRA GUTHYAPPA,SURENDRA GUTHYAPPA,1987-01-05,32.232717,2015-10-05,NaT,NaT,62716,19752.0,0.0,82468.0,both
6,14746,69264,69264,PRASATH MR,PRASATH MR,1990-08-30,28.583162,2016-01-11,NaT,NaT,25971,7955.0,0.0,33926.0,both
7,15084,69828,69828,RANJITHKUMAR C,RANJITHKUMAR C,1994-05-07,24.898015,2016-03-14,NaT,NaT,36976,11298.0,0.0,48274.0,both
8,16065,50224,50224,JOHN I,JOHN I,1977-01-30,42.162902,2006-01-05,NaT,NaT,47622,31852.0,0.0,79474.0,both
9,16190,50814,50814,KALAIVANI S,KALAIVANI S,1983-06-06,35.816564,2008-02-18,NaT,NaT,27979,9543.0,0.0,37522.0,both
10,16755,54439,54439,KULWANT SINGH,KULWANT SINGH,1984-05-02,34.910335,2010-01-11,NaT,NaT,125106,38761.0,0.0,163867.0,both
11,23241,78123,78123,NAZEEMA BANU SHAIK,NAZEEMA BANU SHAIK,1991-06-22,27.772758,2017-04-17,NaT,NaT,27116,8549.0,0.0,35665.0,both
12,25869,50260,50260,SUDHARSANAN K V,SUDHARSANAN K V,1979-10-24,39.433265,2000-04-01,NaT,NaT,198470,110620.0,0.0,309090.0,both
13,25873,50541,50541,VICTOR PREVIN KUMAR D,VICTOR PREVIN KUMAR D,1980-07-09,38.724162,2000-04-01,NaT,NaT,59094,29752.0,0.0,88846.0,both
14,26037,200277,200277,RAGUL M,RAGUL M,1997-07-31,21.664613,2017-10-30,NaT,NaT,14953,14953.0,0.0,29906.0,both
15,26313,73847,73847,AJAY KUMAR YADAV,AJAY KUMAR YADAV,1986-03-17,33.037645,2013-07-01,NaT,NaT,35706,35706.0,0.0,71412.0,both

In [77]:
#diff_bsv=diff_bsv.drop(["PCD_COD1E"],axis=1)

### NEW TRY

In [78]:
sub_set=set(yyy["PCD_CODE"])

In [79]:
su_set=(set(bsvt["PCD_CODE"]))

In [80]:
unique = pd.DataFrame(sub_set-su_set)

In [81]:
unique.head()

        0
0     NaN
1   50814
2   62326
3  200277
4   50541

In [82]:
unique.columns = ["PCD_CODE"]

In [83]:
unique.head()

  PCD_CODE
0      NaN
1    50814
2    62326
3   200277
4    50541

In [84]:
unique

   PCD_CODE
0       NaN
1     50814
2     62326
3    200277
4     50541
5     66913
6     50224
7     55786
8     54439
9     78123
10    66144
11    50260
12    69828
13    69264
14    73847
15    50023
16    68227

In [85]:
unique["PCD_CODE"].value_counts()

66913     1
50023     1
73847     1
69264     1
69828     1
50260     1
66144     1
78123     1
54439     1
68227     1
50224     1
55786     1
50541     1
200277    1
62326     1
50814     1
Name: PCD_CODE, dtype: int64

## The above method worked as well

## PART 3

In [86]:
fst = pd.read_excel(r"EMP-MASTER\EMP-MASTER.xlsx",sheet_name = "zzz - Trust master")

In [87]:
fst.head()

,SL_NO,COMP_CODE,UNIT_CODE/location code,PCD_CODE,PCD_CODE/cost centre,EMP_NAME,SEX,MARITAL_STATUS,DOB,DOJ,DOL,PF_NO,PF_MEM_START_DATE,GR_START_DATE,EPS_NO
0,1,CGFS,'001,10297_FS,10297_FS,SRAJESH,M,M,1972-12-25,1997-07-11,2008-07-04,187,1997-07-11,1997-07-11,21
1,2,CGFS,'001,10407_FS,10407_FS,RANISAMTANI,F,M,1975-07-16,1998-01-13,2008-12-19,274,1998-01-13,1998-01-13,36
2,3,CGFS,'001,10422_FS,10422_FS,NISHADRKASHID,M,M,1972-12-10,2007-09-12,2008-10-10,288,2007-09-12,2007-09-12,39
3,4,CGFS,'001,10519_FS,10519_FS,DIANAVINCENTTOSCANO,F,M,1975-04-14,1998-07-07,2010-04-30,368,1998-07-07,1998-07-07,53
4,5,CGFS,'001,10693_FS,10693_FS,AMITCHANDRAKANTNAIDU,M,M,1974-05-03,2005-01-15,2008-08-07,472,2005-01-15,2005-01-15,70

In [88]:
fst.shape

(73062, 15)

In [89]:
unn=pd.merge(diff_yyy,fst,how="inner")

In [90]:
unn.shape

(0, 24)

### Therefore no data diff_yyy is common in zzz-Trust master

In [91]:
nfst = pd.read_excel(r"EMP-MASTER.xlsx",sheet_name = "Non zzz - Trust master")

In [92]:
nfst.head()

,SL_NO,COMP_CODE,UNIT_CODE/location code/pf code,PCD_CODE,PCD_CODE/cost centre,EMP_NAME,SEX,MARITAL_STATUS,DOB,DOJ,DOL,PF_NO,PF_MEM_START_DATE,GR_TYPE,EPS_NO
0,1,CGACIS,001,33044,33044,SAYANTAN DAS,M,NaN,1979-09-22,2011-02-14 00:00:00,2014-09-05,33044,2010-07-14,GR-YS,24697
1,2,CGACIS,001,33045,33045,ABHIJIT DEY,M,NaN,1983-05-21,2011-02-15 00:00:00,2012-07-24,33045,2011-02-15,GR-YS,24698
2,3,CGACIS,001,33046,33046,CHIDVILASA RAGHAVA,M,NaN,1980-08-30,2007-10-01 00:00:00,2012-08-06,33046,2008-07-01,GR-YS,24699
3,4,CGACIS,001,33047,33047,DEEPAK KRISHNA,M,NaN,1983-04-27,2011-02-14 00:00:00,2011-12-20,33047,2011-02-14,GR-YS,24700
4,5,CGACIS,001,33048,33048,PARAG SHARMA,M,NaN,1980-10-12,2011-02-15 00:00:00,2012-02-21,33048,2011-02-15,GR-YS,24701

In [93]:
nfst.shape

(160785, 15)

In [193]:
unn1=pd.merge(diff_yyy,nfst,on=["PCD_CODE"],how="inner",suffixes=("_BSV","_NFST"))

In [194]:
unn1.head()

,SL_NO_BSV,PCD_CODE,PCD_COD1E,EMP_NAME_BSV,EMP_NAME1,DOB_BSV,AGE,DOJ_BSV,DOL_BSV,DOS,...,EMP_NAME_NFST,SEX,MARITAL_STATUS,DOB_NFST,DOJ_NFST,DOL_NFST,PF_NO,PF_MEM_START_DATE,GR_TYPE,EPS_NO
0,7999,50023,50023,S.SRIRAM,S.SRIRAM,1979-05-12,39.885010,2003-04-01,NaT,NaT,...,SANTHOSH KUMAR DANDA,M,NaN,1988-08-03,2013-03-04 00:00:00,2013-05-20,50023,2013-03-04,GR-YS,40534
1,8734,55786,55786,VIJAY J,VIJAY J,1983-01-03,36.238193,2011-07-18,NaT,NaT,...,MURALI KRISHNA BATTEPATI,M,NaN,1985-05-01,2013-10-10 00:00:00,2017-06-12,169955,2013-10-10,GR-YS,54083
2,10775,62326,62326,MS. LATHA BN,MS. LATHA BN,1986-06-05,32.818617,2014-04-14,NaT,NaT,...,CAMELLIA BANDOPADHYAY,F,NaN,1989-08-02,2014-05-26 00:00:00,2016-05-10,173755,2014-05-26,GR-YS,57883
3,12800,66144,66144,TULASI PM,TULASI PM,1986-02-03,33.152635,2015-03-23,NaT,NaT,...,VENKATAREDDY MUKKU,M,NaN,1986-07-01,2014-08-28 00:00:00,2016-04-11,176231,2014-08-28,GR-YS,60359
4,13266,66913,66913,MANOJ RAGHUNATH B,MANOJ RAGHUNATH B,1988-03-02,31.077344,2015-06-08,NaT,NaT,...,AMIT KUMAR,M,M,1982-12-30,2014-09-18 00:00:00,2017-03-31,176768,2014-09-18,GR-YS,60896

In [195]:
unn1.to_csv(r"C:\Users\Ravi\Desktop\Work\CAPGEMINI-COMPILATION-DATA\CAPGEMINI-COMPILATION-DATA\OPENIING-BALANCE\bsv in nfst.csv")

### The above data is present in Non zzz- Trust Master

In [96]:
unn1.shape

(14, 29)

In [97]:
unn2=pd.concat([diff_yyy,unn1])

In [98]:
unn2.shape

(30, 34)

In [99]:
unn2["PCD_CODE"].value_counts()

66913     2
50023     2
73847     2
69264     2
69828     2
68227     2
66144     2
78123     2
50224     2
55786     2
50541     2
62326     2
50814     2
50260     2
54439     1
200277    1
Name: PCD_CODE, dtype: int64

### The last two data are not present in any of the Sheets

### Part 4

In [101]:
un_fs=pd.concat([zzz,fst])

In [106]:
un_df=pd.DataFrame(un_fs["PCD_CODE"].value_counts())

In [107]:
un_df.head()

           PCD_CODE
26403_FS          2
110973_FS         2
64752_FS          2
33375_FS          2
58082_FS          2

In [108]:
un_df=un_df[un_df["PCD_CODE"]==1]

In [121]:
un_df.shape

(2848, 1)

In [112]:
un_df_pc = pd.DataFrame(un_df.index)

In [113]:
un_df_pc.columns=["PCD_CODE"]

In [114]:
un_df_pc.head()

   PCD_CODE
0    155049
1    180069
2  46001432
3  46009519
4  46004595

In [124]:
final_vals=pd.merge(zzz,un_df_pc,how="inner",on=["PCD_CODE"])

In [125]:
final_vals.shape

(0, 27)

### Therefore no unique Data From zzz Oneliner is available in zzz - True Master

In [167]:
un_fst=pd.concat([xxx,nfst])

In [169]:
un_nfst_pc=pd.DataFrame(un_fst["PCD_CODE"].value_counts())

In [170]:
un_nfst_pc.head()

        PCD_CODE
42472          3
161000         3
21142          2
188227         2
74399          2

In [171]:
#checking for redundat value in Non zzz True Master
nfst[nfst["PCD_CODE"]=='42472']

,SL_NO,COMP_CODE,UNIT_CODE/location code/pf code,PCD_CODE,PCD_CODE/cost centre,EMP_NAME,SEX,MARITAL_STATUS,DOB,DOJ,DOL,PF_NO,PF_MEM_START_DATE,GR_TYPE,EPS_NO
44624,44625,CGACIS,001,42472,042472,SAMAYITA CHATTERJEE,F,NaN,1982-01-30,2012-05-10 00:00:00,2019-08-31,164541,2010-10-15,GR-YS,48669
46458,46459,06-06-2011,NaN,42472,12-04-2016,2019-11-19 00:00:00,PF-EX,Y,2016-06-03,GENERAL,NaT,NaN,NaT,2011-06-01 00:00:00,N

### The above two values were common in Non zzz True Master

In [172]:
un_nfst_pc=un_fst_pc[un_nfst_pc["PCD_CODE"]==1]

In [173]:
un_nfst_pc.head()

          PCD_CODE
46010755         1
A0021            1
46012911         1
46011194         1
46009708         1

In [175]:
un_nfst_pc=pd.DataFrame(un_nfst_pc.index)

In [176]:
un_nfst_pc.head()

          0
0  46010755
1     A0021
2  46012911
3  46011194
4  46009708

In [177]:
un_nfst_pc.columns=["PCD_CODE"]

In [179]:
un_nfst_pc.head()

   PCD_CODE
0  46010755
1     A0021
2  46012911
3  46011194
4  46009708

In [180]:
un_xxx=pd.merge(xxx,un_nfst_pc,how="inner",on=["PCD_CODE"])

In [182]:
un_xxx.shape

(0, 14)

### Therefore no unique value is there in xxx

In [183]:
xxx.shape

(155427, 14)

In [184]:
nfst.shape

(160785, 15)

In [185]:
rr=pd.merge(xxx,nfst,how="inner",on=["PCD_CODE"])

In [186]:
rr.shape

(155418, 28)